// main.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include "Automata.h"
#include <iostream>
#include <string>
#include <vector>
using namespace std;
int main()
{
	Automata automat_1;
	automat_1.on();
	automat_1.coin(50);
	automat_1.printMenu();
	automat_1.choice(4);
	
	cout << "-----------------------------------------------------------" << endl;
	cout << endl;

	Automata automat_2;
	automat_2.on();
	automat_2.coin(10);
	automat_2.printMenu();
	automat_2.choice(4);
	automat_2.coin(10);
	automat_2.choice(4);
    
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
